/*
Συνάρτηση η οποία δέχεται σαν ορίσματα την θέση μνήμης του πρώτου στοιχείου ενός διανύσματος,την θέση μνήμης 
του τελευταίου στοιχείου ενός διανύσματος και μία αρχική τιμή και υπολογίζει το αθροισμά του.
Στον παρακάτω κώδικα πραγματοποιείται η υλοποίηση της για ένα διάνυσμα ακεραίων.
*/
#include <iostream>
#include <numeric>
#include <vector>

int main()
{
    std::vector <int> vec;
    for(int i=0;i<10;i++)
    {
      vec.push_back(i);
    }
    std::cout<<"Sum:"<<std::accumulate(vec.begin(),vec.end(),0);
    return 0;
}