/*
    Ουρές:::
       • isEmpty(), ελέγχει αν η ουρά είναι άδεια.
       • size(), επιστρέφει το μέγεθος της ουράς.
       • front(), προσπελαύνει το στοιχείο που βρίσκεται στο εμπρός άκρο της ουράς (χωρίς να το αφαιρεί).
       • back(), προσπελαύνει το στοιχείο που βρίσκεται στο πίσω άκρο της ουράς (χωρίς να το αφαιρεί).
       • push(), εισάγει ένα στοιχείο στο πίσω άκρο της ουράς
       • pop(), εξάγει το στοιχείο που βρίσκεται στο εμπρός άκρο της ουράς.
*/


#include "queuelist.cpp"

template <class T>
class queue
{
    private:
       queuelist <T> list;
    public:
      queue();
      ~queue();
      void push(T d);
      void pop();
      T front();
      T back();
      int size();
      bool isEmpty();
};