#include <iostream>

using namespace std;

//Αναφορά(&χ)-->Μια μεταβλητή η οποία δείχνει σε μία συγκεκριμένη θέση μνήμης και μόνο.Αποτελεί το ψευδόνυμο της
void increase(int &x)
{
    x++;
    //Ότι αλλαγές γίνουν στην μεταβλητή x θα γίνουν και στο περιεχόμενο της θέσης μνήμης που αναφέρεται η χ
}

int main(int argc,char **argv)
{
    int a;
    cout<<"Give number:";
    //Δέχεται streams(Αυτομάτη αναγνώριση τύπων)
    //printf("%d",a);
    cin>>a;//Διάβασμα τιμής για την μεταβλητή a απο τον χρήστη.
    increase(a);//Αυξάνει την τιμή μίας μεταβλητής κατά 1.
    cout<<"a:"<<a<<endl;
    //endl-->\n
}